StoneRose35/cortexguitarfx/Src/rp2040/usb.c
    }
    
    descr->bLength=c+2;
    descr->bString=str;
    descr->bDescriptorType=3;
}

const UsbDeviceDescriptorType pipicofxUsbDeviceDescriptor = {
    .bLength=DEVICE_DESCRIPTOR_LENGTH,
    .bDescriptorType=1,
    .bcdUSB=0x200,
    .bDeviceClass=2, //239, // taken from tinyusb cdc_msc example config
    .bDeviceSubClass=2, // taken from tinyusb cdc_msc example config
    .bMaxPacketSize=64,
    .idVendor=0xcafe, // NOT OFFICIAL
    .idProduct=0x4003, // NOT OFFICIAL
    .bcdDevice=0x100, // taken from tinyusb cdc_msc example config
    .iManufacturer=1, // taken from tinyusb cdc_msc example config
    .iProduct=2, // taken from tinyusb cdc_msc example config
    .iSerialNumber=3, // taken from tinyusb cdc_msc example config
    .bNumConfigurations=1, // taken from tinyusb cdc_msc example config
    .bDeviceProtocol=0
};


typedef struct {
    const UsbConfigurationDescriptorType config;
    //const uint8_t interfaceAssociation[8];
    const UsbInterfaceDescriptorType cdcControlInterface;
    const uint8_t cdcCSDescriptors[5+5+4+5];
    const UsbEndpointDescriptorType cdcControlEpIn;
    const UsbInterfaceDescriptorType cdcDataInterface;
    const UsbEndpointDescriptorType cdcDataEpIn;
    const UsbEndpointDescriptorType cdcDataEpOut;
} pipicofxFullConfigDescriptorType;


const uint8_t pipicofxfc[] = {
    // configuration descriptor
CONFIGURATION_DESCRIPTOR_LENGTH,2,CONFIGURATION_DESCRIPTOR_LENGTH 
                    + INTERFACE_DESCRIPTOR_LENGTH*2 
                    + ENDPOINT_DESCRIPTOR_LENGTH*3
                    + 19,0x0,2,1,4,0x80,50,
    // cdc control interface descriptor
    INTERFACE_DESCRIPTOR_LENGTH,4,0,0,1,2,2,0,5,
    // cdc cd descriptors
    5, 0x24, CDC_FUNC_DESC_HEADER, 0x20, 0x1, // CDC Header, version 1.2
    5, 0x24, CDC_FUNC_DESC_CALL_MANAGEMENT, 0, 1, // call management: no capabilities, data interface 1
    4, 0x24, CDC_FUNC_DESC_ABSTRACT_CONTROL_MANAGEMENT, 2, // 2: 0Device supports the request combination of Set_Line_Coding, Set_Control_Line_State, Get_Line_Coding, and the notification Serial_State.
    5, 0x24, CDC_FUNC_DESC_UNION, 0, 1, // control interface is interface 0, subordinate interface is interface 1
    // EP 1 in: control endpoit
    ENDPOINT_DESCRIPTOR_LENGTH,5,0x81,(ENDPOINT_ATTR_TRANSFERTYPE_INTERRUPT << ENDPOINT_ATTR_TRANSFERTYPE_POS) |
                    (ENDPOINT_ATTR_SYNC_TYPE_NO_SYNC << ENDPOINT_ATTR_SYNC_TYPE_POS) |
                    (ENDPOINT_ATTR_USAGE_DATA << ENDPOINT_ATTR_USAGE_POS),0x8,0x0,16,
    // cdc data interface
    INTERFACE_DESCRIPTOR_LENGTH,4,1,0,2,10,0,0,6,
    // data endpoint in
    ENDPOINT_DESCRIPTOR_LENGTH,5,0x82,(ENDPOINT_ATTR_TRANSFERTYPE_BULK << ENDPOINT_ATTR_TRANSFERTYPE_POS) |
                    (ENDPOINT_ATTR_SYNC_TYPE_NO_SYNC << ENDPOINT_ATTR_SYNC_TYPE_POS) |
                    (ENDPOINT_ATTR_USAGE_DATA << ENDPOINT_ATTR_USAGE_POS),0x40,0x0,0,
    // data endpoint out
    ENDPOINT_DESCRIPTOR_LENGTH,5,0x2,(ENDPOINT_ATTR_TRANSFERTYPE_BULK << ENDPOINT_ATTR_TRANSFERTYPE_POS) |
                    (ENDPOINT_ATTR_SYNC_TYPE_NO_SYNC << ENDPOINT_ATTR_SYNC_TYPE_POS) |
                    (ENDPOINT_ATTR_USAGE_DATA << ENDPOINT_ATTR_USAGE_POS),0x40,0x0,0,
};
const pipicofxFullConfigDescriptorType pipicofxFullConfig  = {
    .config ={
        .bLength=CONFIGURATION_DESCRIPTOR_LENGTH,
        .bDescriptorType=2,
        .bNumInterfaces=2,
        .wTotalLength=CONFIGURATION_DESCRIPTOR_LENGTH 
                    + INTERFACE_DESCRIPTOR_LENGTH*2 
                    + ENDPOINT_DESCRIPTOR_LENGTH*3
                    + 19,
        .bConfigurationValue=1,
        .iConfiguration=4, //add extra string describing the config
        .bmAttributes=0x80, // bus powered
        .bMaxPower=50 // 100mA
    },
    //.interfaceAssociation = {8,11,0,2,2,2,0,0},
    .cdcControlInterface={
        .bLength=INTERFACE_DESCRIPTOR_LENGTH,
        .bDescriptorType=4,
        .bInterfaceNumber=0,
        .bAlternateSetting=0,
        .bNumEndpoints=1,
        .bInterfaceClass=2,
        .bInterfaceSubClass=2,
        .bInterfaceProtocol=0,
        .iInterface=5 // add string descriptor
    },
    .cdcCSDescriptors = { // as specified in CDC PSTN Subclass Specification
        5, 0x24, CDC_FUNC_DESC_HEADER, 0x20, 0x1, // CDC Header, version 1.2
        5, 0x24, CDC_FUNC_DESC_CALL_MANAGEMENT, 0, 1, // call management: no capabilities, data interface 1
        4, 0x24, CDC_FUNC_DESC_ABSTRACT_CONTROL_MANAGEMENT, 2, // 2: 0Device supports the request combination of Set_Line_Coding, Set_Control_Line_State, Get_Line_Coding, and the notification Serial_State.
        5, 0x24, CDC_FUNC_DESC_UNION, 0, 1 // control interface is interface 0, subordinate interface is interface 1
    },
    .cdcControlEpIn = {
        .bLength=ENDPOINT_DESCRIPTOR_LENGTH,
        .bDescriptorType=5,
        .bEndpointAddress=0x81,
        .bmAttributes=(ENDPOINT_ATTR_TRANSFERTYPE_INTERRUPT << ENDPOINT_ATTR_TRANSFERTYPE_POS) |
                    (ENDPOINT_ATTR_SYNC_TYPE_NO_SYNC << ENDPOINT_ATTR_SYNC_TYPE_POS) |
                    (ENDPOINT_ATTR_USAGE_DATA << ENDPOINT_ATTR_USAGE_POS),
        .wMaxPacketSize=0x8,
        .bInterval=16
    },
    .cdcDataInterface = {
        .bLength=INTERFACE_DESCRIPTOR_LENGTH,
        .bDescriptorType=4,
        .bInterfaceNumber=1,
        .bAlternateSetting=0,
        .bNumEndpoints=2,
        .bInterfaceClass=10,
        .bInterfaceSubClass=0,
        .bInterfaceProtocol=0,
        .iInterface=6 // add string descriptor
    },
    .cdcDataEpIn = {
        .bLength=ENDPOINT_DESCRIPTOR_LENGTH,
        .bDescriptorType=5,
        .bEndpointAddress=0x82,
        .bmAttributes=(ENDPOINT_ATTR_TRANSFERTYPE_BULK << ENDPOINT_ATTR_TRANSFERTYPE_POS) |
                    (ENDPOINT_ATTR_SYNC_TYPE_NO_SYNC << ENDPOINT_ATTR_SYNC_TYPE_POS) |
                    (ENDPOINT_ATTR_USAGE_DATA << ENDPOINT_ATTR_USAGE_POS),
        .wMaxPacketSize=0x40,
        .bInterval=0
    },
    .cdcDataEpOut = {
        .bLength=ENDPOINT_DESCRIPTOR_LENGTH,
        .bDescriptorType=5,
        .bEndpointAddress=0x2,
        .bmAttributes=(ENDPOINT_ATTR_TRANSFERTYPE_BULK << ENDPOINT_ATTR_TRANSFERTYPE_POS) |
                    (ENDPOINT_ATTR_SYNC_TYPE_NO_SYNC << ENDPOINT_ATTR_SYNC_TYPE_POS) |
                    (ENDPOINT_ATTR_USAGE_DATA << ENDPOINT_ATTR_USAGE_POS),
        .wMaxPacketSize=0x40,
        .bInterval=0
    }
} ;


