StoneRose35/cortexguitarfx/Src/rp2040/usb.c
const uint8_t pipicoString0Descriptor[] = {
    4,3,0x9,0x4
};
//const UsbString0DescriptorType pipicoString0Descriptor = {
//    .bDescriptorType=3,
//    .bLength=4,
//    .wLangId=0x409
//};

char const* pipicofxStringDescriptors[] = {
    "Stonerose35", // 1: Manufacturer 
    "PiPicoFX", // 2: Product
    "123456789012", // 3: Serial Number
    "Default Config", // 4: Configuration
    "CDC Control", // Interface
    "CDC Data" // Interface
};


UsbEndpointConfigurationType ep0={
    .nr=0
};
UsbEndpointConfigurationType ep1={
    .nr=1
};
UsbEndpointConfigurationType ep2={
    .nr=2
};

static volatile uint16_t deviceAddress;
static volatile uint8_t setAddress=0;
static uint8_t epBfr[64];
static volatile UsbMultipacketTransfer transferhandler= {
    .address=0,
    .bMaxPacketSize=0,
    .idx=0,
    .len=0,
    .transferInProgress=0
};

// usb controller interrupt routine
void isr_usbctrl_irq5()
{
    uint32_t stat;
    stat = usb_hw->ints;
    UsbSetupPacket setupPacket;
    UsbStringDescriptorType stringdescr;
    volatile uint8_t descrType;
    volatile uint8_t descrIndex;
    char charbfr[8];


    if ((stat & (1 << USB_INTS_BUFF_STATUS_LSB)) != 0) // when a buffer is transferred
    {
        uint32_t bfrstatus = usb_hw->buf_status;
        for(uint8_t c=0;c<16;c+=2)
        {
            if ((bfrstatus & (1 << c))!=0) // IN transfer done
            {
                if (usb_hw->sie_status & USB_SIE_STATUS_ACK_REC_BITS)
                {
                    printf("ACK rec.\r\n");
                    usb_hw_clear->sie_status = USB_SIE_STATUS_ACK_REC_BITS;
                }
                // handle in endpoint transferred
                // endpoint nr is c>>1
                usb_hw_clear->buf_status = (1 << c);
                if ((c>>1)==0) // endpoint 0
                {
                    if(setAddress)
                    {
                        usb_hw->dev_addr_ctrl=deviceAddress;
                        setAddress=0;
                    }
                    else if (transferhandler.transferInProgress==1) // handle multi-packet transfers
                    {
                        if ((transferhandler.idx + transferhandler.bMaxPacketSize) > transferhandler.len)
                        {
                            usb_start_in_transfer(&ep0,(const uint8_t*)(transferhandler.address+transferhandler.idx),transferhandler.len-transferhandler.idx);
                            transferhandler.idx=transferhandler.len;
                            transferhandler.transferInProgress=0;
                        } 
                        else if ((transferhandler.idx + transferhandler.bMaxPacketSize) == transferhandler.len)
                        {
                            usb_start_in_transfer(&ep0,(const uint8_t*)(transferhandler.address+transferhandler.idx),transferhandler.bMaxPacketSize);
                            transferhandler.idx=transferhandler.len;
                            transferhandler.transferInProgress=1; // send a zero-length packet in the end
                        }
                        else
                        {
                            usb_start_in_transfer(&ep0,(const uint8_t*)(transferhandler.address+transferhandler.idx),transferhandler.bMaxPacketSize);
                            transferhandler.idx += transferhandler.bMaxPacketSize;
                        }
                    }
                    else
                    {
                        usb_start_out_transfer(&ep0,0);
                    }
                }
                //TODO add handlers for ep1 and ep2
            }
            if ((bfrstatus & (1 << (c+1)))!=0)
            {
                // handle out endpoint transferred
                // endpoint nr is c>>1
                usb_hw_clear->buf_status = (1 << (c+1));
                //TODO add handlers for ep1 and ep2
            }
        }
    }
    // setup case
    if ((stat & (1 << USB_INTS_SETUP_REQ_LSB)) != 0)
    {
        // gather setup packet
        setupPacket = (UsbSetupPacket)usb_dpram->setup_packet;
        usb_hw_clear->sie_status = (1 << USB_SIE_STATUS_SETUP_REC_LSB);
        
        if ((setupPacket->mbRequestType & (SETUP_PACKET_REQTYPE_DIR_DEVICE_TO_HOST))==(SETUP_PACKET_REQTYPE_DIR_DEVICE_TO_HOST))
        {
            switch (setupPacket->bRequest)
            {
                case SETUP_PACKET_REQ_GET_CONFIGURATION:
                    break;
                case SETUP_PACKET_REQ_GET_DESCRIPTOR:
                    descrType=setupPacket->wValue >> 8; 
                    descrIndex=setupPacket->wValue & 0xFF;
                    switch (descrType)
                    {
                        case (SETUP_PACKET_DESCR_TYPE_DEVICE):
                            
                            ep0.pid=1;
                            printf("get device descriptor\r\n");
                            usb_start_in_transfer(&ep0,(uint8_t*)&pipicofxUsbDeviceDescriptor,DEVICE_DESCRIPTOR_LENGTH);
                            break;
                        case (SETUP_PACKET_DESCR_TYPE_CONFIGURATION):
                            if (setupPacket->wLength == CONFIGURATION_DESCRIPTOR_LENGTH)
                            {
                                printf("get configuration descriptor\r\n");
                                usb_start_in_transfer(&ep0,(uint8_t*)&(pipicofxFullConfig.config),CONFIGURATION_DESCRIPTOR_LENGTH);
                            }
                            else // send full configuration descriptor, divide into pieces of bMaxPacketSize length
                            {
                                transferhandler.address=(uint32_t)pipicofxfc;
                                transferhandler.bMaxPacketSize=pipicofxUsbDeviceDescriptor.bMaxPacketSize;
                                transferhandler.idx=0;
                                transferhandler.len=pipicofxFullConfig.config.wTotalLength;
                                transferhandler.transferInProgress=1;
                                printf("get full configuration descriptor\r\n");
                                if ((transferhandler.idx + transferhandler.bMaxPacketSize) > transferhandler.len)
                                {
                                    usb_start_in_transfer(&ep0,(const uint8_t*)(transferhandler.address+transferhandler.idx),transferhandler.len-transferhandler.idx);
                                    transferhandler.idx=transferhandler.len;
                                    transferhandler.transferInProgress=0;
                                } 
                                else if ((transferhandler.idx + transferhandler.bMaxPacketSize) == transferhandler.len)
                                {
                                    usb_start_in_transfer(&ep0,(const uint8_t*)(transferhandler.address+transferhandler.idx),transferhandler.bMaxPacketSize);
                                    transferhandler.idx=transferhandler.len;
                                    transferhandler.transferInProgress=1; // send a zero-length packet in the end
                                }
                                else
                                {
                                    usb_start_in_transfer(&ep0,(const uint8_t*)(transferhandler.address+transferhandler.idx),transferhandler.bMaxPacketSize);
                                    transferhandler.idx += transferhandler.bMaxPacketSize;
                                }
                                //usb_start_in_transfer(&ep0,(uint8_t*)&pipicofxFullConfig,pipicofxFullConfig.config.wTotalLength);
                            }
                            break;
                        case (SETUP_PACKET_DESCR_TYPE_STRING):
                            if (descrIndex==0)
                            {
                                printf("get lang string descriptor\r\n");
                                memcpy(epBfr,pipicoString0Descriptor,4);
                                usb_start_in_transfer(&ep0,epBfr,4);
                            }
                            else 
                            {
                                printf("get string descriptor ");
                                UInt16ToChar(descrIndex,charbfr);
                                printf(charbfr);
                                printf("\r\n");
                                generateStringDescriptor(&ep0,&stringdescr,pipicofxStringDescriptors[descrIndex-1]);
                                usb_start_in_transfer(&ep0,0,stringdescr.bLength);
                            }
                            break;
                        default:
                            break;
                    }
                    break;
                case SETUP_PACKET_REQ_GET_STATUS:
                    break;
                case SETUP_PACKET_REQ_SYNCH_FRAME:
                    break;
                default:
                    break;
            }
        }
        else // Host to Device
        {
            switch(setupPacket->bRequest)
            {
                case SETUP_PACKET_REQ_CLEAR_FEATURE:
                    break;
                case SETUP_PACKET_REQ_SET_ADDRESS:
                    deviceAddress = setupPacket->wValue;
                    setAddress=1;
                    printf("set address received, address: ");
                    UInt16ToChar(deviceAddress,charbfr);
                    printf(charbfr);
                    printf("\r\n");
                    usb_start_in_transfer(&ep0,0,0); // send empty package to acknowledge
                    break;
                case SETUP_PACKET_REQ_SET_CONFIGURATION:
                    printf("set configuration\r\n");
                    usb_start_in_transfer(&ep0,0,0); // send empty package to acknowledge
                    break;
                case SETUP_PACKET_REQ_SET_DESCRIPTOR:
                    //break;
                case SETUP_PACKET_REQ_SET_FEATURE:
                    //break;
                case SETUP_PACKET_REQ_SET_INTERFACE:
                    //break;
                default:
                    //blindly acknowledge at first...
                    printf("got unknown request \r\n");
                    UInt8ToChar(setupPacket->bRequest,charbfr);
                    printf(charbfr);
                    printf("\n");
                    usb_start_in_transfer(&ep0,0,0); // send empty package to acknowledge
                    break;
            }
        }
    }
    if ((stat & (1 << USB_INTS_BUS_RESET_LSB)) != 0) // bus reset
    {
        printf("usb reset\r\n");
        usb_hw_clear->sie_status = (1 << USB_SIE_STATUS_BUS_RESET_LSB);
        usb_hw->dev_addr_ctrl=0;
        setAddress=0;
    }

    // 
}


void usb_start_in_transfer(UsbEndpointConfigurationType * ep,const uint8_t * data,uint8_t len)
{
    uint32_t ctrlval;
    if (data)
    {
        memcpy(ep->bufferIn,data,len);
    }
    ctrlval = len | (1 << EP_BUFFER_CTRL_BUFFER_0_AVAIL) | (1 << EP_BUFFER_CTRL_BUFFER_0_FULL);
    ctrlval |= ep->pid ? USB_BUF_CTRL_DATA1_PID : USB_BUF_CTRL_DATA0_PID;
    ep->pid ^=1;
    usb_dpram->ep_buf_ctrl[ep->nr].in = ctrlval;
    __asm__("nop");
    __asm__("nop");
    __asm__("nop");    
}

void usb_start_out_transfer(UsbEndpointConfigurationType * ep,uint8_t len)
{
    uint32_t ctrlval;
    ctrlval = len | (1 << EP_BUFFER_CTRL_BUFFER_0_AVAIL) | (0 << EP_BUFFER_CTRL_BUFFER_0_FULL);
    ctrlval |= ep->pid ? USB_BUF_CTRL_DATA1_PID : USB_BUF_CTRL_DATA0_PID;
    ep->pid ^=1;
    usb_dpram->ep_buf_ctrl[ep->nr].out = ctrlval;
    __asm__("nop");
    __asm__("nop");
    __asm__("nop");  
}


void initUsbCdcDevice()
{
    ep0.bufferIn=usb_dpram->ep0_buf_a;
    ep0.bufferOut=usb_dpram->ep0_buf_a;
    ep0.dpram=usb_dpram;
    ep0.pid=0;
    ep0.nr=0;

